//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.


for (let i = 1; i <= 10; i++)
{
    document.write(`<div>text</div>`)
}


// -------------------------------------------------------------

for (let i = 1; i <= 10; i++)
{
    document.write(`<div>`+ i +`text</div>`)
}

// --------------------------------------------------------------


// let x= 0
// while (x < 20){
//     document.write(`<div><h1>TEXT</h1></div>`)
// }


//---------------------------------------------------------------


// let y = 0
// while(y < 20){
//     document.write(`<div>`+ y +`<h1>TXT2</h1></div>`)
// }

// ---------------------------------------------------------------------------------------




//- Використовуючи дані з масиву, за допомоги document.write та циклу
//побудувати структуру по шаблону.
// замість 'ITEM OF ARRAY' підставити елемент з масиву щоб получився цілий список з даними з масиву

// ШАБЛОН:
//     <ul>
//         <li>ITEM OF ARRAY</li>
//         <!--
//             і тд інші об'єкти масиву
//              ...
//              ...
//              ...
//         -->
//     </ul>



let listOfItems = ['html', 'css', 'javascript', 'mysql', 'mongodb', 'react', 'angular', 'node.js'];


document.write(`<ul>`)
for (const listOfItem of listOfItems) {
    document.write(`<li>` + listOfItem + `</li>`)
}
document.write(`<ul>`)
